## Insertion

insert(place where you want to add value ie index, name of the column , data you want to give)

In [1]:
import pandas as pd

In [2]:
var=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [3]:
var.insert(1,"python",var["A"])
var

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

In [4]:
var.insert(1,"python_1",[12,13,14,15,16])
var

   A  python_1  python  B
0  1        12       1  9
1  2        13       2  8
2  3        14       3  7
3  4        15       4  6
4  5        16       5  5

In [5]:
var["python_12"]=var["A"][:3]
var

   A  python_1  python  B  python_12
0  1        12       1  9        1.0
1  2        13       2  8        2.0
2  3        14       3  7        3.0
3  4        15       4  6        NaN
4  5        16       5  5        NaN

# Delete

In [9]:
var=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var2=var.pop("B")
var2

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

In [16]:
var2=var.pop("A")
var

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]